In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
data=pd.read_csv("adult.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
data.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
country           0
salary            0
dtype: int64

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  country         32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [5]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [6]:
uniquecount=data.nunique()
print(uniquecount)

age                  73
workclass             9
fnlwgt            21648
education            16
education-num        16
marital-status        7
occupation           15
relationship          6
race                  5
sex                   2
capital-gain        119
capital-loss         92
hours-per-week       94
country              42
salary                2
dtype: int64

In [7]:
data.drop('age',axis=1,inplace= True)
data.drop('fnlwgt',axis=1,inplace= True)
data.drop('education-num',axis=1,inplace= True)
data.drop('marital-status',axis=1,inplace= True)
data.drop('relationship',axis=1,inplace= True)
data.drop('race',axis=1,inplace= True)
data.drop('sex',axis=1,inplace= True)

In [8]:
data.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,salary
0,State-gov,Bachelors,Adm-clerical,2174,0,40,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Exec-managerial,0,0,13,United-States,<=50K
2,Private,HS-grad,Handlers-cleaners,0,0,40,United-States,<=50K
3,Private,11th,Handlers-cleaners,0,0,40,United-States,<=50K
4,Private,Bachelors,Prof-specialty,0,0,40,Cuba,<=50K

In [9]:
count=data['country'].unique()
print(count)

[' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']

In [10]:
work=data['workclass'].unique()
print(work)

[' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 ' ?' ' Self-emp-inc' ' Without-pay' ' Never-worked']

In [11]:
print(data['workclass'].nunique('?'))

9

In [12]:
print((data['workclass'] == ' ?').sum())

1836

In [13]:
data['workclass']= data['workclass'].replace(' ?', np.NAN)

In [14]:
work=data['workclass'].unique()
print(work)

[' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 nan ' Self-emp-inc' ' Without-pay' ' Never-worked']

In [15]:
print((data['workclass'] == ' ?').sum())

0

In [16]:
print(data['education'].unique())

[' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']

In [17]:
print(data['education'].nunique())

16

In [18]:
print(data['occupation'].unique())

[' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Craft-repair' ' Transport-moving'
 ' Farming-fishing' ' Machine-op-inspct' ' Tech-support' ' ?'
 ' Protective-serv' ' Armed-Forces' ' Priv-house-serv']

In [19]:
print((data['occupation'] == ' ?').sum())

1843

In [20]:
data['occupation']= data['occupation'].replace(' ?', np.NAN)

In [21]:
print((data['occupation'] == ' ?').sum())

0

In [22]:
print(data['capital-gain'].unique())

[ 2174     0 14084  5178  5013  2407 14344 15024  7688 34095  4064  4386
  7298  1409  3674  1055  3464  2050  2176   594 20051  6849  4101  1111
  8614  3411  2597 25236  4650  9386  2463  3103 10605  2964  3325  2580
  3471  4865 99999  6514  1471  2329  2105  2885 25124 10520  2202  2961
 27828  6767  2228  1506 13550  2635  5556  4787  3781  3137  3818  3942
   914   401  2829  2977  4934  2062  2354  5455 15020  1424  3273 22040
  4416  3908 10566   991  4931  1086  7430  6497   114  7896  2346  3418
  3432  2907  1151  2414  2290 15831 41310  4508  2538  3456  6418  1848
  3887  5721  9562  1455  2036  1831 11678  2936  2993  7443  6360  1797
  1173  4687  6723  2009  6097  2653  1639 18481  7978  2387  5060]

In [23]:
print((data['capital-gain'] == 0).sum())

29849

In [24]:
print(data['capital-loss'].unique())

[   0 2042 1408 1902 1573 1887 1719 1762 1564 2179 1816 1980 1977 1876
 1340 2206 1741 1485 2339 2415 1380 1721 2051 2377 1669 2352 1672  653
 2392 1504 2001 1590 1651 1628 1848 1740 2002 1579 2258 1602  419 2547
 2174 2205 1726 2444 1138 2238  625  213 1539  880 1668 1092 1594 3004
 2231 1844  810 2824 2559 2057 1974  974 2149 1825 1735 1258 2129 2603
 2282  323 4356 2246 1617 1648 2489 3770 1755 3683 2267 2080 2457  155
 3900 2201 1944 2467 2163 2754 2472 1411]

In [25]:
print(data['hours-per-week'].unique())

[40 13 16 45 50 80 30 35 60 20 52 44 15 25 38 43 55 48 58 32 70  2 22 56
 41 28 36 24 46 42 12 65  1 10 34 75 98 33 54  8  6 64 19 18 72  5  9 47
 37 21 26 14  4 59  7 99 53 39 62 57 78 90 66 11 49 84  3 17 68 27 85 31
 51 77 63 23 87 88 73 89 97 94 29 96 67 82 86 91 81 76 92 61 74 95]

In [26]:
print(data['country'].unique())

[' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']

In [27]:
data['country']= data['country'].replace(' ?', np.NAN)

In [28]:
print((data['country']==' ?').sum())

0

In [29]:
print(data['country'].unique())

[' United-States' ' Cuba' ' Jamaica' ' India' nan ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']

In [30]:
print(data['salary'].unique())

[' <=50K' ' >50K']

In [31]:
data.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,salary
0,State-gov,Bachelors,Adm-clerical,2174,0,40,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Exec-managerial,0,0,13,United-States,<=50K
2,Private,HS-grad,Handlers-cleaners,0,0,40,United-States,<=50K
3,Private,11th,Handlers-cleaners,0,0,40,United-States,<=50K
4,Private,Bachelors,Prof-specialty,0,0,40,Cuba,<=50K

In [32]:
data.isnull().sum()

workclass         1836
education            0
occupation        1843
capital-gain         0
capital-loss         0
hours-per-week       0
country            583
salary               0
dtype: int64

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   workclass       30725 non-null  object
 1   education       32561 non-null  object
 2   occupation      30718 non-null  object
 3   capital-gain    32561 non-null  int64
 4   capital-loss    32561 non-null  int64
 5   hours-per-week  32561 non-null  int64
 6   country         31978 non-null  object
 7   salary          32561 non-null  object
dtypes: int64(3), object(5)
memory usage: 2.0+ MB

In [34]:
newdata=data.dropna()

In [35]:
newdata.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30162 entries, 0 to 32560
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   workclass       30162 non-null  object
 1   education       30162 non-null  object
 2   occupation      30162 non-null  object
 3   capital-gain    30162 non-null  int64
 4   capital-loss    30162 non-null  int64
 5   hours-per-week  30162 non-null  int64
 6   country         30162 non-null  object
 7   salary          30162 non-null  object
dtypes: int64(3), object(5)
memory usage: 2.1+ MB

In [36]:
newdata.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,salary
0,State-gov,Bachelors,Adm-clerical,2174,0,40,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Exec-managerial,0,0,13,United-States,<=50K
2,Private,HS-grad,Handlers-cleaners,0,0,40,United-States,<=50K
3,Private,11th,Handlers-cleaners,0,0,40,United-States,<=50K
4,Private,Bachelors,Prof-specialty,0,0,40,Cuba,<=50K

In [37]:
newdata["workclass"].value_counts()

workclass
 Private             22286
 Self-emp-not-inc     2499
 Local-gov            2067
 State-gov            1279
 Self-emp-inc         1074
 Federal-gov           943
 Without-pay            14
Name: count, dtype: int64

In [38]:
newdata["education"].value_counts()

education
 HS-grad         9840
 Some-college    6678
 Bachelors       5044
 Masters         1627
 Assoc-voc       1307
 11th            1048
 Assoc-acdm      1008
 10th             820
 7th-8th          557
 Prof-school      542
 9th              455
 12th             377
 Doctorate        375
 5th-6th          288
 1st-4th          151
 Preschool         45
Name: count, dtype: int64

In [39]:
newdata["occupation"].value_counts()

occupation
 Prof-specialty       4038
 Craft-repair         4030
 Exec-managerial      3992
 Adm-clerical         3721
 Sales                3584
 Other-service        3212
 Machine-op-inspct    1966
 Transport-moving     1572
 Handlers-cleaners    1350
 Farming-fishing       989
 Tech-support          912
 Protective-serv       644
 Priv-house-serv       143
 Armed-Forces            9
Name: count, dtype: int64

In [40]:
y = newdata.loc[:,['salary']]

In [41]:
y.count()

salary    30162
dtype: int64

In [42]:
newdata.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,salary
0,State-gov,Bachelors,Adm-clerical,2174,0,40,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Exec-managerial,0,0,13,United-States,<=50K
2,Private,HS-grad,Handlers-cleaners,0,0,40,United-States,<=50K
3,Private,11th,Handlers-cleaners,0,0,40,United-States,<=50K
4,Private,Bachelors,Prof-specialty,0,0,40,Cuba,<=50K

In [43]:
newdata.drop('salary',axis=1,inplace= True)

C:\Users\thele\AppData\Local\Temp\ipykernel_11048\396858519.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdata.drop('salary',axis=1,inplace= True)

In [44]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(newdata,y, test_size=0.3, random_state=42)

In [45]:
X_train.head(20)

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country
29253,Private,HS-grad,Craft-repair,0,0,40,United-States
14267,Private,HS-grad,Handlers-cleaners,0,0,40,United-States
26021,Private,Bachelors,Exec-managerial,0,0,60,United-States
24278,Private,HS-grad,Other-service,0,0,32,United-States
4225,Self-emp-inc,HS-grad,Adm-clerical,0,0,38,United-States
30293,State-gov,Some-college,Adm-clerical,0,0,40,United-States
5243,Private,Assoc-voc,Prof-specialty,0,0,40,United-States
27206,Federal-gov,Bachelors,Exec-managerial,0,0,40,United-States
16071,State-gov,HS-grad,Craft-repair,0,0,40,United-States
3208,Private,10th,Machine-op-inspct,0,0,40,United-States
27406,Local-gov,HS-grad,Protective-serv,0,0,40,United-States
8247,Local-gov,Some-college,Adm-clerical,0,0,40,United-States
17054,Self-emp-not-inc,HS-grad,Exec-managerial,0,2559,50,United-States
22550,Private,HS-grad,Other-service,0,0,39,United-States
18308,Private,HS-grad,Craft-repair,0,0,40,United-States
17652,Private,Bachelors,Exec-managerial,0,0,40,United-States
18986,Self-emp-not-inc,Some-college,Craft-repair,0,0,48,United-States
5796,Federal-gov,Bachelors,Adm-clerical,0,0,45,Germany
12745,Private,Some-college,Sales,3103,0,50,United-States
14444,Private,HS-grad,Tech-support,0,0,40,United-States

In [46]:
X_test.head(20)

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country
234,Private,Prof-school,Prof-specialty,0,0,55,United-States
26879,Private,HS-grad,Craft-repair,0,0,40,Taiwan
19182,Private,HS-grad,Other-service,0,0,50,Germany
13485,Private,HS-grad,Craft-repair,0,0,45,United-States
9625,Local-gov,Bachelors,Prof-specialty,0,0,40,United-States
17085,Private,HS-grad,Transport-moving,0,0,40,United-States
24912,Private,HS-grad,Adm-clerical,0,0,40,United-States
23604,Private,Some-college,Exec-managerial,0,0,40,United-States
9216,Private,HS-grad,Sales,0,0,15,Mexico
17043,Private,Some-college,Prof-specialty,0,0,50,United-States
23693,Private,HS-grad,Exec-managerial,0,0,40,United-States
2311,Private,Some-college,Prof-specialty,0,0,40,United-States
24842,Private,7th-8th,Other-service,0,0,10,United-States
8640,Private,Some-college,Other-service,0,0,35,United-States
5217,Private,HS-grad,Craft-repair,0,0,40,United-States
15834,Private,Masters,Machine-op-inspct,0,0,40,Mexico
18687,Private,Some-college,Exec-managerial,0,0,60,United-States
7055,Private,HS-grad,Adm-clerical,0,0,35,United-States
8832,State-gov,Masters,Prof-specialty,0,0,40,United-States
32018,Private,11th,Adm-clerical,0,0,5,United-States

In [47]:
from sklearn.preprocessing import OrdinalEncoder

custom_order1 =[
    " Preschool",
    " 1st-4th",
    " 5th-6th",
    " 7th-8th",
    " 9th",
    " 10th",
    " 11th",
    " 12th",
    " HS-grad",
    " Some-college",
    " Assoc-acdm",
    " Assoc-voc",
    " Bachelors",
    " Masters",
    " Doctorate",
    " Prof-school"
]
encoder1 = OrdinalEncoder(categories=[custom_order1])
X_train['education_e'] = encoder1.fit_transform(X_train['education'].values.reshape(-1,1))
X_test['education_e'] = encoder1.transform(X_test['education'].values.reshape(-1,1))

In [48]:
X_train.head(20)

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,education_e
29253,Private,HS-grad,Craft-repair,0,0,40,United-States,8.0
14267,Private,HS-grad,Handlers-cleaners,0,0,40,United-States,8.0
26021,Private,Bachelors,Exec-managerial,0,0,60,United-States,12.0
24278,Private,HS-grad,Other-service,0,0,32,United-States,8.0
4225,Self-emp-inc,HS-grad,Adm-clerical,0,0,38,United-States,8.0
30293,State-gov,Some-college,Adm-clerical,0,0,40,United-States,9.0
5243,Private,Assoc-voc,Prof-specialty,0,0,40,United-States,11.0
27206,Federal-gov,Bachelors,Exec-managerial,0,0,40,United-States,12.0
16071,State-gov,HS-grad,Craft-repair,0,0,40,United-States,8.0
3208,Private,10th,Machine-op-inspct,0,0,40,United-States,5.0
27406,Local-gov,HS-grad,Protective-serv,0,0,40,United-States,8.0
8247,Local-gov,Some-college,Adm-clerical,0,0,40,United-States,9.0
17054,Self-emp-not-inc,HS-grad,Exec-managerial,0,2559,50,United-States,8.0
22550,Private,HS-grad,Other-service,0,0,39,United-States,8.0
18308,Private,HS-grad,Craft-repair,0,0,40,United-States,8.0
17652,Private,Bachelors,Exec-managerial,0,0,40,United-States,12.0
18986,Self-emp-not-inc,Some-college,Craft-repair,0,0,48,United-States,9.0
5796,Federal-gov,Bachelors,Adm-clerical,0,0,45,Germany,12.0
12745,Private,Some-college,Sales,3103,0,50,United-States,9.0
14444,Private,HS-grad,Tech-support,0,0,40,United-States,8.0

In [49]:
print(data['workclass'].unique())

[' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 nan ' Self-emp-inc' ' Without-pay' ' Never-worked']

In [50]:
    custom_order2=[" Never-worked"," Without-pay"," Federal-gov"," Self-emp-inc"," State-gov"," Local-gov"," Self-emp-not-inc"," Private"]

encoder2 = OrdinalEncoder(categories=[custom_order2])
X_train['workclass_e'] = encoder2.fit_transform(X_train['workclass'].values.reshape(-1,1))
X_test['workclass_e'] = encoder2.transform(X_test['workclass'].values.reshape(-1,1))

In [51]:
X_test.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,education_e,workclass_e
234,Private,Prof-school,Prof-specialty,0,0,55,United-States,15.0,7.0
26879,Private,HS-grad,Craft-repair,0,0,40,Taiwan,8.0,7.0
19182,Private,HS-grad,Other-service,0,0,50,Germany,8.0,7.0
13485,Private,HS-grad,Craft-repair,0,0,45,United-States,8.0,7.0
9625,Local-gov,Bachelors,Prof-specialty,0,0,40,United-States,12.0,5.0

In [52]:
print(newdata['occupation'].unique())

[' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Transport-moving' ' Farming-fishing'
 ' Machine-op-inspct' ' Tech-support' ' Craft-repair' ' Protective-serv'
 ' Armed-Forces' ' Priv-house-serv']

In [53]:
from sklearn.preprocessing import LabelEncoder
encoder3=LabelEncoder()
X_train['occupation_e']=encoder3.fit_transform(X_train['occupation'])
X_test['occupation_e']=encoder3.transform(X_test['occupation'])

In [54]:
X_test.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,education_e,workclass_e,occupation_e
234,Private,Prof-school,Prof-specialty,0,0,55,United-States,15.0,7.0,9
26879,Private,HS-grad,Craft-repair,0,0,40,Taiwan,8.0,7.0,2
19182,Private,HS-grad,Other-service,0,0,50,Germany,8.0,7.0,7
13485,Private,HS-grad,Craft-repair,0,0,45,United-States,8.0,7.0,2
9625,Local-gov,Bachelors,Prof-specialty,0,0,40,United-States,12.0,5.0,9

In [55]:
encoder4=LabelEncoder()
X_train['country_e']=encoder4.fit_transform(X_train['country'])
X_test['country_e']=encoder4.transform(X_test['country'])

In [56]:
X_train.head()

,workclass,education,occupation,capital-gain,capital-loss,hours-per-week,country,education_e,workclass_e,occupation_e,country_e
29253,Private,HS-grad,Craft-repair,0,0,40,United-States,8.0,7.0,2,38
14267,Private,HS-grad,Handlers-cleaners,0,0,40,United-States,8.0,7.0,5,38
26021,Private,Bachelors,Exec-managerial,0,0,60,United-States,12.0,7.0,3,38
24278,Private,HS-grad,Other-service,0,0,32,United-States,8.0,7.0,7,38
4225,Self-emp-inc,HS-grad,Adm-clerical,0,0,38,United-States,8.0,3.0,0,38

In [57]:
X_train.drop('workclass',axis=1,inplace= True)

In [58]:
X_train.drop('education',axis=1,inplace= True)
X_train.drop('occupation',axis=1,inplace= True)
X_train.drop('country',axis=1,inplace= True)

In [59]:
X_train.head()

,capital-gain,capital-loss,hours-per-week,education_e,workclass_e,occupation_e,country_e
29253,0,0,40,8.0,7.0,2,38
14267,0,0,40,8.0,7.0,5,38
26021,0,0,60,12.0,7.0,3,38
24278,0,0,32,8.0,7.0,7,38
4225,0,0,38,8.0,3.0,0,38

In [60]:
X_test.drop('workclass',axis=1,inplace= True)
X_test.drop('education',axis=1,inplace= True)
X_test.drop('occupation',axis=1,inplace= True)
X_test.drop('country',axis=1,inplace= True)

In [61]:
X_test.head()

,capital-gain,capital-loss,hours-per-week,education_e,workclass_e,occupation_e,country_e
234,0,0,55,15.0,7.0,9,38
26879,0,0,40,8.0,7.0,2,35
19182,0,0,50,8.0,7.0,7,10
13485,0,0,45,8.0,7.0,2,38
9625,0,0,40,12.0,5.0,9,38

In [62]:
Y_train.head()

       salary
29253    >50K
14267   <=50K
26021    >50K
24278   <=50K
4225    <=50K

In [63]:
encoder5=LabelEncoder()
Y_train['salary_e']=encoder5.fit_transform(Y_train['salary'])
Y_test['salary_e']=encoder5.transform(Y_test['salary'])

In [64]:
Y_train.head()

       salary  salary_e
29253    >50K         1
14267   <=50K         0
26021    >50K         1
24278   <=50K         0
4225    <=50K         0

In [65]:
Y_test.head()

       salary  salary_e
234      >50K         1
26879   <=50K         0
19182    >50K         1
13485   <=50K         0
9625    <=50K         0

In [66]:
Y_train.drop('salary',axis=1,inplace=True)
Y_test.drop('salary',axis=1,inplace=True)

In [67]:
Y_train.head()

       salary_e
29253         1
14267         0
26021         1
24278         0
4225          0

decission tree

In [68]:
from sklearn.tree import DecisionTreeClassifier

treemodel = DecisionTreeClassifier(class_weight="balanced")
treemodel.fit(X_train, Y_train)
ans1 = treemodel.predict(X_test)

In [69]:
from sklearn.metrics import accuracy_score
score1 = accuracy_score(Y_test, ans1)
score1

0.7407448336832799

In [71]:
from sklearn.metrics import confusion_matrix
confusion_matrix(Y_test,ans1)

array([[5114, 1653],
       [ 693, 1589]], dtype=int64)

In [72]:
combined_data = pd.concat([X_train, X_test], ignore_index=True)

In [73]:
len(combined_data)

30162

In [74]:
combined_y = pd.concat([Y_train, Y_test], ignore_index=True)

In [75]:
len(combined_y)

30162

In [76]:
from sklearn.model_selection import cross_val_score
cross_val_score(treemodel,combined_data,combined_y)

array([0.74788662, 0.7505387 , 0.74900531, 0.72645889, 0.74867374])

SVC

In [77]:
from sklearn.svm import SVC

svcmodel = SVC(class_weight="balanced")
svcmodel.fit(X_train, Y_train)
ans3 = svcmodel.predict(X_test)

d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [78]:
score = accuracy_score(Y_test, ans3)
score*100

79.2794783954028

In [79]:
confusion_matrix(Y_test,ans3)

array([[6500,  267],
       [1608,  674]], dtype=int64)

In [80]:
cross_val_score(svcmodel,combined_data,combined_y)

d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([0.79164595, 0.80109398, 0.78365385, 0.79376658, 0.7926061 ])

random froest

In [81]:
from sklearn.ensemble import RandomForestClassifier
forestmodel = RandomForestClassifier(class_weight="balanced")
forestmodel.fit(X_train, Y_train)
ans4 = forestmodel.predict(X_test)

d:\github file\Aduit income predicion\Audit_income_prediction\auditenv\lib\site-packages\sklearn\base.py:1151: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return fit_method(estimator, *args, **kwargs)

In [82]:
score = accuracy_score(Y_test, ans4)
score*100

77.14664603823627

In [83]:
confusion_matrix(Y_test,ans4)

array([[5477, 1290],
       [ 778, 1504]], dtype=int64)

XGboost

In [85]:
from xgboost import XGBClassifier
xgmodel = XGBClassifier()
xgmodel.fit(X_train, Y_train)
ans5 = xgmodel.predict(X_test)

In [86]:
score = accuracy_score(Y_test, ans5)
score*100

84.30765830478506

In [87]:
confusion_matrix(Y_test,ans5)

array([[6546,  221],
       [1199, 1083]], dtype=int64)

In [88]:
X_train.head()

,capital-gain,capital-loss,hours-per-week,education_e,workclass_e,occupation_e,country_e
29253,0,0,40,8.0,7.0,2,38
14267,0,0,40,8.0,7.0,5,38
26021,0,0,60,12.0,7.0,3,38
24278,0,0,32,8.0,7.0,7,38
4225,0,0,38,8.0,3.0,0,38

In [89]:
import pickle
pickle.dump(encoder1,open('encoder1.pkl','wb'))
pickle.dump(encoder2,open('encoder2.pkl','wb'))
pickle.dump(encoder3,open('encoder3.pkl','wb'))
pickle.dump(encoder4,open('encoder4.pkl','wb'))
pickle.dump(xgmodel,open('xgmodeling.pkl','wb'))